export type ServiceNamesType = {
  [key: string]: string;
};
export const ServiceNames: ServiceNamesType = {
  دارو: "اسناد دارویی",
  بیمارستانی: "اسناد بیمارستانی",
  پاراکلینیک: "اسناد پاراکیلینکی",
  دندانپزشکی: "اسناد دندانپزشکی",
  "ثبت ارزیابی با اسکن مدارک": "ثبت ارزیابی با اسکن مدارک (مستقیم)",
  "ثبت ارزیابی بدون اسکن مدارک": "ثبت ارزیابی بدون اسکن مدارک (مستقیم)",
  "ثبت ارزیابی بدون اسکن مدارک (غیر مستقیم)":
    "ثبت ارزیابی بدون اسکن مدارک (غیر مستقیم)",
};

export const ShortServiceNames: ServiceNamesType = {
  "اسناد دارویی": "اسناد دارویی",
  "اسناد بیمارستانی": "اسناد بیمارستانی",
  "اسناد پاراکیلینکی": "اسناد پاراکیلینکی",
  "ثبت ارزیابی با اسکن مدارک (مستقیم)": "با اسکن مستقیم",
  "ثبت ارزیابی بدون اسکن مدارک (مستقیم)": "بدون اسکن مستقیم",
  "ثبت ارزیابی بدون اسکن مدارک (غیر مستقیم)": "بدون اسکن غیر مستقیم",
  "اسناد دندانپزشکی": "ثبت ارزیابی دندانپزشکی",
};
